## Manejo de datos faltantes en DataFrames

In [2]:
import numpy as np
import pandas as pd

In [4]:
# Este objeto tiene propuedades matemÃ¡ticas
np.nan

nan

In [5]:
np.nan * 0

nan

In [6]:
np.nan > 0

False

In [7]:
# Pandas viene con un objeto llamado NA, para usarlo escribe
pd.options.mode.use_inf_as_na = True

In [8]:
pd.NA +'Hola mundo'

In [9]:
pd.NA | False

In [10]:
df = pd.DataFrame(np.arange(0, 15).reshape(5, 3), columns=['a', 'b', 'c'])
df

    a   b   c
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [11]:
df['d'] = np.nan
df['e'] = np.arange(15, 20)
df.loc[5,:] = pd.NA
df.loc[4,'a'] = pd.NA
df.loc[0,'d'] = 1
df.loc[5,'d'] = 10
df

      a     b     c    d     e
0     0     1     2    1    15
1     3     4     5  NaN    16
2     6     7     8  NaN    17
3     9    10    11  NaN    18
4  <NA>    13    14  NaN    19
5  <NA>  <NA>  <NA>   10  <NA>

In [12]:
df.isnull()

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False  False  False   True  False
4  False  False  False   True  False
5  False  False  False  False  False

In [13]:
df.isna()

       a      b      c      d      e
0  False  False  False  False  False
1  False  False  False   True  False
2  False  False  False   True  False
3  False  False  False   True  False
4  False  False  False   True  False
5  False  False  False  False  False

In [14]:
df.isnull().sum()

a    0
b    0
c    0
d    4
e    0
dtype: int64

In [15]:
df.notnull().sum(axis=1)

0    5
1    4
2    4
3    4
4    4
5    5
dtype: int64

In [17]:
df.size-df.isnull().sum().sum()

26

In [20]:
df[df['a'].notnull()]

      a     b     c    d     e
0     0     1     2    1    15
1     3     4     5  NaN    16
2     6     7     8  NaN    17
3     9    10    11  NaN    18
4  <NA>    13    14  NaN    19
5  <NA>  <NA>  <NA>   10  <NA>

In [22]:
df.dropna()

      a     b     c   d     e
0     0     1     2   1    15
5  <NA>  <NA>  <NA>  10  <NA>

In [23]:
df[['a']].dropna()

      a
0     0
1     3
2     6
3     9
4  <NA>
5  <NA>

In [25]:
# Llenar los valores nulos
df.fillna(0)

      a     b     c   d     e
0     0     1     2   1    15
1     3     4     5   0    16
2     6     7     8   0    17
3     9    10    11   0    18
4  <NA>    13    14   0    19
5  <NA>  <NA>  <NA>  10  <NA>

In [26]:
df.fillna(method="ffill")

      a     b     c   d     e
0     0     1     2   1    15
1     3     4     5   1    16
2     6     7     8   1    17
3     9    10    11   1    18
4  <NA>    13    14   1    19
5  <NA>  <NA>  <NA>  10  <NA>

In [27]:
df.fillna(method="bfill")

      a     b     c   d     e
0     0     1     2   1    15
1     3     4     5  10    16
2     6     7     8  10    17
3     9    10    11  10    18
4  <NA>    13    14  10    19
5  <NA>  <NA>  <NA>  10  <NA>

In [28]:
df.fillna(method="bfill",axis=1)

      a     b     c     d     e
0     0     1     2   1.0    15
1     3     4     5  16.0    16
2     6     7     8  17.0    17
3     9    10    11  18.0    18
4  <NA>    13    14  19.0    19
5  <NA>  <NA>  <NA>  10.0  <NA>

In [29]:
fill = pd.Series([100, 101, 102])
fill

0    100
1    101
2    102
dtype: int64

In [30]:
df['d'] = df['d'].fillna(fill)
df['d']

0      1.0
1    101.0
2    102.0
3      NaN
4      NaN
5     10.0
Name: d, dtype: float64

In [31]:
df

      a     b     c      d     e
0     0     1     2    1.0    15
1     3     4     5  101.0    16
2     6     7     8  102.0    17
3     9    10    11    NaN    18
4  <NA>    13    14    NaN    19
5  <NA>  <NA>  <NA>   10.0  <NA>

In [32]:
df.fillna(df.median())

      a     b     c      d     e
0     0     1     2    1.0    15
1     3     4     5  101.0    16
2     6     7     8  102.0    17
3     9    10    11   55.5    18
4  <NA>    13    14   55.5    19
5  <NA>  <NA>  <NA>   10.0  <NA>

In [33]:
df.fillna(df.median())

      a     b     c      d     e
0     0     1     2    1.0    15
1     3     4     5  101.0    16
2     6     7     8  102.0    17
3     9    10    11   55.5    18
4  <NA>    13    14   55.5    19
5  <NA>  <NA>  <NA>   10.0  <NA>

In [34]:
df_d = pd.concat([df[['d']], df[['d']].interpolate()],axis=1)
df_d.columns = ['d_antes','d_interpolado']
df_d

   d_antes  d_interpolado
0      1.0       1.000000
1    101.0     101.000000
2    102.0     102.000000
3      NaN      71.333333
4      NaN      40.666667
5     10.0      10.000000